app/controllers/songs_controller.rb

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 0]]
SELECT COUNT(*) FROM "artists" WHERE "artists"."id" = ?  [["id", 0]]
SELECT "songs".* FROM "songs" WHERE "songs"."artist_id" = ?  [["artist_id", 5]]
---
  def index
    if params[:artist_id]
      if !Artist.where(id: params[:artist_id]).empty?
        @artist = Artist.find(params[:artist_id])
        @songs = @artist.songs
      else
        flash[:alert] = "Artist not found."
        redirect_to artists_path
      end
    else
      @songs = Song.all

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 5]]
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 7]]
SELECT COUNT(*) FROM "songs" WHERE "songs"."id" = ?  [["id", 12345]]
---
  def show
    if params[:artist_id]
      @artist = Artist.find(params[:artist_id])
      if !Song.where(id: params[:id]).empty?